Kurzschlusskind/CLOSEDGATE/sdkconfig.defaults
# CLOSEDGATE Default Configuration

# Target: ESP32-C3
CONFIG_IDF_TARGET="esp32c3"

# Authentication modes
CONFIG_CLOSEDGATE_YUBIKEY_ENABLED=n
CONFIG_CLOSEDGATE_MIFARE_ENABLED=y
CONFIG_CLOSEDGATE_MIFARE_MAX_UIDS=20
CONFIG_CLOSEDGATE_MIFARE_DEFAULT_UIDS=""

# Enable certificate bundle for TLS
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# WiFi configuration
CONFIG_ESP_WIFI_SCAN_RSSI_THRESHOLD=-127
CONFIG_ESP_WIFI_NVS_ENABLED=y

# Partition table
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Logging level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# I2C configuration
CONFIG_I2C_MANAGER_0_ENABLED=n
CONFIG_I2C_MANAGER_1_ENABLED=n

# HTTP Client
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# NVS
CONFIG_NVS_ENCRYPTION=n

# Task watchdog (increase timeout for NFC polling)
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Stack size for main task
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Buzzer configuration
CONFIG_CLOSEDGATE_BUZZER_ENABLED=y
CONFIG_CLOSEDGATE_BUZZER_GPIO=7
CONFIG_CLOSEDGATE_BUZZER_VOLUME=50
CONFIG_CLOSEDGATE_BUZZER_BOOT_SOUND=y
CONFIG_CLOSEDGATE_BUZZER_CARD_SOUND=y
CONFIG_CLOSEDGATE_BUZZER_ACCESS_SOUND=y
CONFIG_CLOSEDGATE_BUZZER_WIFI_SOUND=y
CONFIG_CLOSEDGATE_BUZZER_ERROR_SOUND=y
